---
kind: method
id: M:Autodesk.Revit.DB.IPerformanceAdviserRule.GetName
source: html/208ec0e9-3612-2413-ae1c-05e284c5ae50.htm
---
# Autodesk.Revit.DB.IPerformanceAdviserRule.GetName Method

Retrieves the name of the rule.

## Syntax (C#)
```csharp
string GetName()
```

## Returns
The name of the rule.

## Remarks
Method should return a short string naming the rule, typically as a one word in TitleCase. String should be localized.